

export const page2_table_carousel = [
    "空调：几乎不开，可能用风扇代替。\n洗衣机：每周1次，冷水洗涤。\n冰箱：节能小型冰箱，持续运行。\n电视/电脑：使用频率极低，电视每周几次，电脑偶尔用。\n热水器：基本不用，冷水洗澡为主。\n照明：LED灯，每晚使用3小时以内。\n厨房电器：很少使用，仅偶尔用电饭煲、电水壶。\n生活特点：极度节约，低舒适度。",

    "空调：夏季每天1-2小时，冬季偶尔取暖。\n洗衣机：每周1-2次，冷水洗涤为主。\n冰箱：小型冰箱正常运作，耗电15-30度。\n电视/电脑：每天1小时左右。\n热水器：每周洗澡2-3次，速热功能。\n照明：LED灯，每晚4小时左右。\n厨房电器：简单烹饪，电饭煲、电水壶使用正常。\n生活特点：轻微舒适度，有节制。",

    "空调：每天3-4小时，夏季较舒适。\n洗衣机：每周2次，偶尔用温水。\n冰箱：正常运行，小型冰箱。\n电视/电脑：每天1-2小时娱乐时间。\n热水器：每周3次，洗澡时间可稍长。\n照明：LED灯，每晚4-5小时。\n厨房电器：偶尔使用微波炉，电饭煲、水壶正常用。\n生活特点：基本舒适，略节制。",

    "空调：每天4-6小时，舒适温度调节。\n洗衣机：每周2-3次，可用温水洗涤。\n冰箱：小型冰箱，持续运行。\n电视/电脑：每天电视或电脑使用2小时以上。\n热水器：每周3-4次，每次20-30分钟。\n照明：LED灯，每晚5小时左右。\n厨房电器：正常使用微波炉、电饭煲。\n生活特点：舒适度较高，控制合理。",

    "空调：每天8小时以上，可整晚开。\n洗衣机：每周3-4次，温水洗涤。\n冰箱：中型节能冰箱，正常运作。\n电视/电脑：每天3小时以上娱乐使用。\n热水器：每周4-5次洗澡，热水随时可用。\n照明：LED灯，每晚5-6小时，灵活使用。\n厨房电器：电饭煲、水壶、微波炉使用正常，有时用烤箱。\n生活特点：更加自由，舒适度显著提高。",

    "空调：全天空调可用，温度随意调节。\n洗衣机：每周4次以上，支持温水洗涤。\n冰箱：中型冰箱持续运行。\n电视/电脑：每天使用4小时以上。\n热水器：每周5-6次洗澡，时间长且频率高。\n照明：LED灯随时使用。\n厨房电器：电饭煲、水壶、微波炉等家电灵活使用，高功率设备如烤箱也常用。\n生活特点：高舒适度，使用无忧。",

    "空调：全天使用空调，完全随意调节。\n洗衣机：每周4-5次以上，使用高档功能和温水。\n冰箱：中型或大型冰箱正常使用。\n电视/电脑：每天使用5小时以上。\n热水器：每日洗澡，热水器使用无限制。\n照明：LED灯随意开启，无需节制。\n厨房电器：电饭煲、电水壶、微波炉、烤箱、电磁炉都可正常使用。\n生活特点：极高舒适度，用电自由。"
]


export const stages_notice = []

export const stage2_tippages = ["在本实验中，您的低碳行为将为您生成一定的碳积分。同时，您的电力消耗量和碳积分总量将与其他实验参与者进行比较和排名。请尽可能真实地反映您的决策倾向！", "在本实验中，您的低碳行为将为您生成一定的碳积分。同时，您的电力消耗量和碳积分总量将与其他实验参与者进行比较和排名。\n系统将在每轮开始前为您发放一定数量的虚拟币作为初始资产。请注意，如果在结算界面，您的虚拟币余额不足以支付本轮的电费账单，您将被强制退出实验。每轮结束后，虚拟币余额不会清零，下一轮开始时系统会发放新一批的虚拟币。请合理规划和使用您的虚拟币，以完成实验中的任务。", "在本实验中，您的低碳行为将为您生成一定的碳积分。同时，您的电力消耗量和碳积分总量将与其他实验参与者进行比较和排名。\n系统将在每轮开始前为您发放一定数量的虚拟币作为初始资产。请注意，如果在结算界面，您的虚拟币余额不足以支付本轮的电费账单，您将被强制退出实验。每轮结束后，虚拟币余额不会清零，下一轮开始时系统会发放新一批的虚拟币。\n在每轮结算前，系统将为您提供一个碳积分兑换的选项。您可以将本轮累计的碳积分兑换成一定数量的虚拟币，从而缓解支付电费账单的压力。请根据您的实际情况和策略，合理利用碳积分兑换功能，优化您的决策结果。", "在本实验中，您的低碳行为将为您生成一定的碳积分，同时，您的电力消耗量和碳积分总量将与其他实验参与者进行比较和排名。\n系统将在每轮开始前为您发放一定数量的虚拟币作为初始资产。如果在每轮的结算界面中，您的虚拟币余额不足以支付本轮的电费账单，您将被强制退出实验。需要注意的是，每轮结束后，您的虚拟币余额不会清零，下一轮开始时系统会发放新的虚拟币。\n此外，系统将在每轮开始前分配给您一定的碳配额。如果您的电力消耗超出碳配额，超出的部分将按更高的单价收费；若超出配额100%，则会在结算界面被强制退出。每轮结算后配额会清零，下一轮开始时系统会发放新的虚拟币。为了优化您的决策，您可以在结算前通过碳配额交易系统使用虚拟币买卖碳配额，合理规划电力使用和碳配额管理。"]

export const maxround = 12

// QUESTION 11 MEDIAN
export const que11CommuteKilometers = { 'A': 1.5, 'B': 4, 'C': 7.5, 'D': 15, 'E': 45, 'F': 50, 'G': 20 }

// HOW MANY DAYS WILL PEOPLE GO TRIP 
// A : 1, one day one trip
export const que10TripsFrequency = { 'A': 1, 'B': 2, 'C': 3, 'D': (7 * 2 / 3), 'E': 7, 'F': 15 }

export const MonthlyDays = 30


export const RoundRateInterval = {
    'vir_curr_rate': {
        'max': 0.95,
        'min': 0.85
    },
    'carb_cred_exchange_rate': {
        'max': 0.44,
        'min': 0.36
    },
    'carb_quota_rate': {
        'max': 0.95,
        'min': 0.8
    },
    'carb_quota_trade_rate': {
        'max': 1.36,
        'min': 1.24
    }
}
export const QuestionTypes = ["radio", "checkbox", "blank", "matrixradio", "matrixtext"]
